Autodesk.Revit.DB.Family.HasStructuralSection
Identifies if this Family can have a structural section.
Returns:
True if the Family can have structural section, false otherwise.
Since:
2015

Autodesk.Revit.DB.Family.IsUserCreated
Determine if the family is defined by the user. Some families are created internally and cannot be saved or reloaded. This function should return false.
Since:
2015

Autodesk.Revit.DB.Family.Symbols
A set of all symbols (types) that belong to a Family.
Remarks: Returns a read only set of all the symbols that belong to a particular family. The family
symbol objects within this set can be used to swap an instance from one type to another.